performanceTest/src/test/resources/request-bodies/GetSRSInformation1.xml

<!--
  ~ Copyright (C) 2016 Inera AB (http://www.inera.se)
  ~
  ~ This file is part of sklintyg (https://github.com/sklintyg).
  ~
  ~ sklintyg is free software: you can redistribute it and/or modify
  ~ it under the terms of the GNU General Public License as published by
  ~ the Free Software Foundation, either version 3 of the License, or
  ~ (at your option) any later version.
  ~
  ~ sklintyg is distributed in the hope that it will be useful,
  ~ but WITHOUT ANY WARRANTY; without even the implied warranty of
  ~ MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
  ~ GNU General Public License for more details.
  ~
  ~ You should have received a copy of the GNU General Public License
  ~ along with this program.  If not, see <http://www.gnu.org/licenses/>.
  -->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:clinicalprocess:healthcond:srs:GetSRSInformationResponder:1" xmlns:urn1="urn:riv:clinicalprocess:healthcond:certificate:types:2">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:GetSRSInformationRequest>
         <urn:version>1</urn:version>
         <urn:konsument-id>
            <urn1:root>1.2.752.129.2.1.4.1</urn1:root>
            <urn1:extension>123456</urn1:extension>
         </urn:konsument-id>
         <urn:individer>
            <!--1 or more repetitions:-->
            <urn:individ>
               <urn:person-id>191212121212</urn:person-id>
               <!--1 or more repetitions:-->
               <urn:diagnos>
                  <urn:code>M188</urn:code>
                  <urn:codeSystem>1.2.752.116.1.1.1.1.3</urn:codeSystem>
               </urn:diagnos>
               <urn:omfattning>HELT_NEDSATT</urn:omfattning>
            </urn:individ>
         </urn:individer>
         <urn:utdatafilter>
            <urn:prediktion>true</urn:prediktion>
            <urn:atgardsrekommendation>true</urn:atgardsrekommendation>
            <urn:fmbinformation>false</urn:fmbinformation>
         </urn:utdatafilter>
         <!--You may enter ANY elements at this point-->
      </urn:GetSRSInformationRequest>
   </soapenv:Body>
</soapenv:Envelope>